In [1]:
import pandas as pd
data= pd.read_csv('student.csv')
data

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   21
5     6   ayesha    BE  49.55   22
6     7     amar    BE  65.34   19
7     8    amita    BE  58.55   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [14]:
data['marks'].mean()

63.520999999999994

In [15]:
data['age'].max()

23

In [16]:
data.count()  # Non-missing values (non-null)

roll     10
name     10
class    10
marks    10
age      10
dtype: int64

In [17]:
data.isnull().sum()   # will return the missing values

roll     0
name     0
class    0
marks    0
age      0
dtype: int64

In [18]:
data.iloc[7,3]   # finding values

58.55

In [19]:
data.dropna()  # dropping values of Na
# but it removes 40% of Data (so only valid for less no. of rows and columns)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   21
5     6   ayesha    BE  49.55   22
6     7     amar    BE  65.34   19
7     8    amita    BE  58.55   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [20]:
data.fillna(0)  # filling Nan with zeros

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   21
5     6   ayesha    BE  49.55   22
6     7     amar    BE  65.34   19
7     8    amita    BE  58.55   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [21]:
data.fillna(method='backfill')  # backfilling is parameter passed 
# it adds (next element)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   21
5     6   ayesha    BE  49.55   22
6     7     amar    BE  65.34   19
7     8    amita    BE  58.55   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [22]:
data.fillna(method='pad')  # is a method passed  which adds previous value

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   21
5     6   ayesha    BE  49.55   22
6     7     amar    BE  65.34   19
7     8    amita    BE  58.55   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [23]:
# taking  (mean/median) for continuos variable  by filling Na values
data['marks'].fillna(data['marks'].median())

0    56.77
1    59.77
2    76.88
3    69.66
4    63.28
5    49.55
6    65.34
7    58.55
8    56.75
9    78.66
Name: marks, dtype: float64

In [24]:
# mode is used for categorical variables
data['class'].fillna(data['class'].mode()[0])

0    TE
1    TE
2    BE
3    TE
4    TE
5    BE
6    BE
7    BE
8    TE
9    BE
Name: class, dtype: object

In [25]:
data['class'].mode()[0]      # Te replaced to Na (as it is mode)

'BE'

# Testing and Training  Dataset

# Social Network Ads

In [26]:
data=pd.read_csv('Social_Network_Ads.csv')
data

      User ID  Gender   Age  EstimatedSalary  Purchased
0    15624510    Male  19.0          19000.0          0
1    15810944    Male  35.0          20000.0          0
2    15668575  Female  26.0          43000.0          0
3    15603246  Female  27.0          57000.0          0
4    15804002    Male  19.0          76000.0          0
..        ...     ...   ...              ...        ...
395  15691863  Female  46.0          41000.0          1
396  15706071    Male  51.0          23000.0          1
397  15654296  Female  50.0          20000.0          1
398  15755018    Male  36.0          33000.0          0
399  15594041  Female  49.0          36000.0          1

[400 rows x 5 columns]

In [27]:
data.shape

(400, 5)

In [28]:
data.columns  # name of columns

Index(['User ID', 'Gender', 'Age', 'EstimatedSalary', 'Purchased'], dtype='object')

In [29]:
X = data[['Age','EstimatedSalary']]  #(Input )

In [30]:
Y= data['Purchased']   # (Output) Data  only 0 and 1{categorical}

In [31]:
len(X)    # no of rows

400

In [32]:
X.head()

    Age  EstimatedSalary
0  19.0          19000.0
1  35.0          20000.0
2  26.0          43000.0
3  27.0          57000.0
4  19.0          76000.0

In [33]:
# SKLEARN
from sklearn.model_selection import train_test_split

# IMP

In [34]:
X_train,X_test,Y_train,Y_test=train_test_split(
  X,Y,test_size=0.25,random_state=0)
# test size defines out of whole dataset(400) 25% will go to test dataset
# ie; 100 will go for training dataset
# 300 will go to train

In [35]:
len(X_train)

300

In [36]:
len(X_test)

100

In [37]:
X_train.head()

      Age  EstimatedSalary
250  44.0          39000.0
63   32.0         120000.0
312  38.0          50000.0
159  32.0         135000.0
283  52.0          21000.0

In [38]:
Y_train.head()

250    0
63     1
312    0
159    1
283    1
Name: Purchased, dtype: int64

In [39]:
 X.std()

Age                   10.482877
EstimatedSalary    34096.960282
dtype: float64

# Feature Scaling

In [34]:
from sklearn.preprocessing import StandardScaler # used to perform 
# Feature Scaling

In [35]:
scaler= StandardScaler()

In [39]:
X_scaled=scaler.fit_transform(X)

In [40]:
pd.DataFrame(X_scaled).std()

0    1.001252
1    1.001252
dtype: float64

In [41]:
X.describe()

              Age  EstimatedSalary
count  400.000000       400.000000
mean    37.655000     69742.500000
std     10.482877     34096.960282
min     18.000000     15000.000000
25%     29.750000     43000.000000
50%     37.000000     70000.000000
75%     46.000000     88000.000000
max     60.000000    150000.000000

# Normalisation 
# z= x-min(x)/ max(x)-min(x)

In [42]:
from sklearn.preprocessing import MinMaxScaler

In [43]:
scaler=MinMaxScaler()

In [46]:
X_scaled= scaler.fit_transform(X)  # fit is to get data pattern and 
# transform is to apply it

In [47]:
pd.DataFrame(X_scaled).describe()

                0           1
count  400.000000  400.000000
mean     0.467976    0.405500
std      0.249592    0.252570
min      0.000000    0.000000
25%      0.279762    0.207407
50%      0.452381    0.407407
75%      0.666667    0.540741
max      1.000000    1.000000

# Binarisation

In [48]:
# you need values in either yes/no   , true/false
# if value> threshold = 1   if less than equalto threshold= 0

In [49]:
from sklearn.preprocessing import Binarizer

In [50]:
bin= Binarizer(threshold=30)   # analog --> digital value
# above 30= 1
# else it will be  0

In [51]:
X_scaled= bin.fit_transform(X)

In [52]:
pd.DataFrame(X_scaled).head()

     0    1
0  0.0  1.0
1  1.0  1.0
2  0.0  1.0
3  0.0  1.0
4  0.0  1.0

# Encoding

In [54]:
# converting data to number format----Encoding

In [55]:
data=pd.read_csv('student.csv')
data

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   21
5     6   ayesha    BE  49.55   22
6     7     amar    BE  65.34   19
7     8    amita    BE  58.55   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [56]:
from sklearn.preprocessing import LabelEncoder

In [57]:
le= LabelEncoder()

In [58]:
data['name']=le.fit_transform(data['name'])

In [59]:
data

   roll  name class  marks  age
0     1     6    TE  56.77   22
1     2     2    TE  59.77   21
2     3     5    BE  76.88   19
3     4     0    TE  69.66   20
4     5     8    TE  63.28   21
5     6     9    BE  49.55   22
6     7     1    BE  65.34   19
7     8     3    BE  58.55   23
8     9     4    TE  56.75   20
9    10     7    BE  78.66   21

In [60]:
# Names are replaced by the numbers
# but values can be misinterpreted

# One hot Encoding

In [61]:
 # here value is only in 1 and 0

In [62]:
data=pd.read_csv('student.csv')

In [63]:
data_encoded= pd.get_dummies(data)

In [64]:
data_encoded.head()   # whole dataset converted to One Hot Encoded Format

,roll,marks,age,name_ajinkya,name_amar,name_amit,name_amita,name_amol,name_aniket,name_anil,name_anmol,name_asha,name_ayesha,class_BE,class_TE
0,1,56.77,22,0,0,0,0,0,0,1,0,0,0,0,1
1,2,59.77,21,0,0,1,0,0,0,0,0,0,0,0,1
2,3,76.88,19,0,0,0,0,0,1,0,0,0,0,1,0
3,4,69.66,20,1,0,0,0,0,0,0,0,0,0,0,1
4,5,63.28,21,0,0,0,0,0,0,0,0,1,0,0,1

In [65]:
data_encoded.shape

(10, 15)